{"pages":[{"url":"http://yeching.info/me.html","text":"Introduce 男 90后 普通二本 专业学的 矿物加工工程 。 是一个闲不住的人，兴趣比较广泛，不给自己设限，永远在不停的学习当中 Origin 好奇心 学习了各种各样的东西，需要更好的整理归纳。与他人分享，探讨。 随着自己的成长，感觉需要留下一点东西，当自己回头看时，能够看见自己成长的过程 。 Contact Email: yeching.info@gmail.com","tags":"Others","title":"Me"},{"url":"http://yeching.info/road.html","text":"人最宝贵的是生命。它给予我们只有一次。人的一生应当这样度过：当他回首往事时不因虚度年华而悔恨，也不因碌碌无为而羞耻。这样在他临死的时侯就能够说：\"我已把我整个的生命和全部精力都献给最壮丽的事业—为人类的解放而斗争。 说得多么好的一段话啊，可惜有几个人能有这样的觉悟，又有几个人能够这么幸运ˉ找到一份，能够把自己人生整个生命和全部精力都投入进去的事业。其实绝大多数人都是不确定未来自己能够干什么，更不用谈事业了。 有些人他们从小就知道自己长大想要干什么，他们一直走在属于他们的大道上，他们所干的正是他们所想的，他们不用告诉自己要坚持，要努力，给自己打气。在我们眼中难以忍受的事情，在他们眼里都是幸福快乐，当他们与其他人聊起他所做的事情时，眼睛是放光的，嘴角是挂着微笑的。发自内心深处的声音，总是那么真诚，那么有力量，让人除了羡慕更多的是自卑。 未来的自己能否找到一份属于我的事业，不得而知，兴许那天就碰上了一件改变我的人生轨迹的事情，当然了也可能这一辈子也没有找到。有人说，这辈子能够对某件事情产生浓厚的兴趣，那真是上天的恩赐啊，你得好好的感谢上天。 能够一生坚持只干一件事情的人，那很让人敬佩，当然我更想知道是，到底是什么东西使得他们如此坚定。如果一个人，一辈子从事了很多行业，那也没有什么不对，这个行业我待久了，想换一个新的环境试试那有什么不可。人们可能会说这不忠诚，喜新厌旧。我想说，一个人只有先忠诚自己，才能更好的忠诚于他人。 如今的我更多的是根据性格的自我发展，现在刚走上社会，未来会如何，我不知道。干事方面，我只能是尽人事，听天命；态度方面，只能知天命，尽人事。 时间会一天一天的流逝，人也会一天一天的成长。 当那天闲下来的时候，为了翻看历史，有迹可循，看到自己曾经走过的路，看过的景。总得留下点什么东西，可以是文字，可以是照片，亦可以是影像作品。虽然绝大多数时候回看时，总感觉以前的自己太幼稚，没思想，但是我希望自己看过之后能够相似一笑。那一抹微笑，即代表着你对过去自己的默认，也代表着对现在自己现状的满意。 少壮不努力，老大徒伤悲。年轻的时候，得不断持续学习，切勿贪图享受，居安要思危。 有知识，有思想，有情怀；敢想，敢做，敢当 。","tags":"生活杂集","title":"找到你的路"},{"url":"http://yeching.info/gitconfig.html","text":"有时候因为自己需要，可能要在一台电脑上设置多个GIthub账号要在同一台电脑上给两个属于不同帐号的仓库提交时。但是一把公钥只能被一个GITHUB帐号拥有，因此必须为不同的帐号创建不同的公钥进行配对。 方法步骤： 1.制作公钥 制造第一把公钥： ssh-keygen -t rsa -C \"yq08051035@163.com\" 设置名称为id_rsa Enter file in which to save the key (.ssh/id_rsa): id_rsa 制造第二把公钥： ssh-keygen -t rsa -C \"yq08051035@gmail.com\" 设置名称为my Enter file in which to save the key (.ssh/id_rsa): my 2.把id_rsa.pub添加到后台SSH账户 查看文件是否存在 将id_rsa.pub添加到yq08051035@163.com帐号的后台ssh。 将my.pub添加到yq08051035@gmail.com帐号的后台ssh。 3.在.ssh目录下配置config文件 Host github.com HostName github.com PreferredAuthentications publickey IdentityFile ~/.ssh/id_rsa Host my.github.com HostName github.com PreferredAuthentications publickey IdentityFile ~/.ssh/my 4.测试 ssh -T git@github.com Hi yeching! You've successfully authenticated, but GitHub does not provide shell access. ssh -T git@my.github.com Hi aifusheng! You've successfully authenticated, but GitHub does not provide shell access. 说明OK。 当我们要在一个仓库上PUSH提交的内容时，先解析出仓库地址，然后从该仓库的所属帐号中找到一把能解锁该提交的公钥。","tags":"计算机技术与应用","title":"一台电脑多个GITHUB帐号设置"},{"url":"http://yeching.info/shi-bo-hui.html","text":"图片来源人民网和唐山世园会网 4月2号，来到唐山，正好赶上了2016唐山世园会进行第二次试运营，拿了一张免费的门票，走进了世园会。 刚开始，并没有什么与众不同的感觉，紧接着往后走，走进了国内园。没有见过世面的我看的目瞪口呆，各式各样的建筑，民族特色，眼花缭乱的分都分不清楚，只跟着瞎凑热闹。这时深深感觉到没有文化的可怕，对自己国家的名族文化都不太了解（心里默默流泪啊）。由于来的太晚了，国内园还没了解完就要关闭了，看看地图，天哪，怎么还有这么多地方没看呢。嘻嘻，还好还有机会再来，下次多做一点准备。 出来了，回想了一下，自己也说不出看了啥了。主要是太突然了，没有计划；同时自己见识太少了。根本就不了解这样的博览会，仅仅听过而已。 回到学校上网查了一下，原来世界博览会分为两种形式，一种是 综合性世博会 ，另一种是 专业性世博会。 世界园艺博览会是世界博览会中的一类， 国际展览局（BIE） 将世界博览会分为注册类（展示本国的产品或技术）和认可类（展出某类专业性产品）。 像德国汉诺威世界博览会和上海博览会就属于综合性（注册类）世博会；像昆明世界园艺博览会和唐山园艺博览会的就属于专业性（认可类）世博会。 上国际展览局网站上看了并没有关于 International Horticulture Exposition Tangshan 2016 的信息，原来国际展览局对 国际园艺生产者协会（AIPH） 批准的A1类世界园艺博览会进行认可。其他类并不认可。 世界园艺博览会是由国际园艺生产者协会组织的，而国际园艺生产者协会将世界园艺博览会分成A1,A2,B1,B2四个类；世界博览会是由国际展览局组织的，只对国际园艺生产者协会批准的A1类世界园艺博览会进行认可。2016 唐山世界园艺博览会属于A2+B1类，所以在国际展览局网站上没有相关消息，而在国际园艺生产者协会网站上就能看到相应的信息了。 2016年唐山世界园艺博览会将于4月29日至10月16日在唐山市南湖公园举办，会期是171天。本届世园会以\"都市与自然·凤凰涅槃\"为主题。 我还得再去一次。 网站: International Horticulture Exposition Tangshan 2016 国际展览局 国际园艺生产者协会","tags":"生活杂集","title":"2016唐山世界园艺博览会"},{"url":"http://yeching.info/have-a-taste-of-negative-energy-one.html","text":"都给我走开，让我哭一会 1.太感动了 2.为什么 3.有骨气 4.自豪 5.又被揭穿了 6.太黑暗了 7.压抑不住了 8.心想事成 内容来自： 林正疆微博","tags":"Positive&Negative Energy","title":"Have a taste of negative energy(一)"},{"url":"http://yeching.info/johan-cruyff.html","text":"As a fans of FC Barcelona for three years,I often focus on the news about the Barcelona.This morning,I as usual enter the barcelona website.The title of \"Johan Cruyff passes away at 68\" hits me. The following content is from Barcelona's official website . Johan Cruyff passes away at 68 FC Barcelona legend Johan Cruyff passed away on Thursday 24 March following a long battle with cancer. Cruyff arrived at the club in August 1973 from Ajax, renowned as one of the best players in the world. Barça soon began to reap the rewards as the Dutch magician helped Barça to the league title in his first season, and went on to win his second and third Ballon d'Or. With his intelligent play, superb technique and leadership, he quickly became an icon for Barça. His acrobatic strike against Atlético Madrid and the 5-0 win at the Santiago Bernabeu in 1974, among many other great moments, will live long in the memory of Barça fans. In 1978, after winning the Copa del Rey, Cruyff left the club. Ten years later, however, he would return as manager. He was in the dugout for eight seasons, during which time he led the club through its most successful ever period up until that point. He won four consecutive league titles and guided the club to its first ever European Cup in May 1992 at Wembley, among other successes. He formed the side that would go onto be known as the legendary ‘Dream Team', a team that amazed everyone with their extraordinary style. In 1996, he left the Barça bench, and in 1999 was chosen as the player of the century in Europe. He was a figure actively involved with Catalonia too, and in September 2006, the Government of Catalonia awarded him with the Cross of St. George, and he later became the manager of the Catalan national football team. Letter from the presidents of FC Barcelona to Johan Cruyff Barcelona, 24 March 2016 Thank you, Johan. Johan Cruyff's death is sad news for the entire world of football. His individual and collective achievements made him one of the best players and coaches in history and the professional and personal footprint he left at our club is enormous. First and foremost, we want to convey our sincerest condolences to the Cruyff family and to all the Club's players and staff who, throughout his various stages as a player and coach, shared emotions, efforts and the joys of success. On a day like today, every FC Barcelona fan will recall their own memories of and experiences relating to Cruyff as both a leader and as a symbol. We, as presidents of FC Barcelona, have the immense honour to give thanks, on behalf of Barcelona supporters everywhere, to a brilliant and audacious man who decisively marked the trajectory of the club. We are thankful to Cruyff for his work as a player and as a coach, and for the titles he achieved. But above all, we are thankful for the intangibles which are still alive today and which will endure into the future, for they are worth more than all those titles; Cruyff endowed us with high levels of self-esteem and set a new course for the success of FC Barcelona. With Cruyff we began to play differently, breaking new ground and innovating. With him, both as a player and coach, we established our own style on the field, what is traditionally known as 'total football,' the Barça style everyone admires. The arrival of Cruyff altered the history of Barça. He contributed decisively to a change of mentality. He got us to keep our heads up and to see that no opponent was invincible, that we could attain what we were aiming for. Cruyff was an icon who explained, better than anyone, that Barça is more than a club. He did it simply and based in reality, and always moving forward. Without Cruyff's unabashed and non-conformist spirit, we quite possibly wouldn't have become the greatest club in the world. So, again, thank you, Johan. Thanks to the man who was admired, thanks to the social icon, thanks to the football superstar. Thank you for your audacity, thank you for your expertise, and thank you for having chosen Barça and Barcelona in the same way that, for Barça and Catalonia, you have always been, and will always be, one of us. Thank you, Johan. FC Barcelona mourns the death of Johan Cruyff The club expresses its condolences towards its legendary former player and manager who will always be remembered in the highest regard FC Barcelona would like to express its pain and sorrow at the passing away of Johan Cruyff (Amsterdam, 25/04/1947 - Barcelona, 24/03/2016), who was both an FC Barcelona player and a coach and who will forever be a legend at the Club. FC Barcelona wishes to send its most heartfelt sympathy to Johan Cruyff's family at such a painful moment, a sentiment which the Club members, fans and the whole world of football and sport will share. Rest in peace Thank you Johan. The flags at Camp Nou have been placed at half-mast.","tags":"English-Learning","title":"Johan Cruyff"},{"url":"http://yeching.info/lao-fu-ren-de-hong-dong.html","text":"北京时间3月17日凌晨3点45分，15-16赛季欧冠联赛八分之一淘汰赛次回合迎来一场重头戏，德甲巨无霸拜仁慕尼黑坐镇主场安联球场迎战意甲斑马军团尤文图斯。双方首回合的比赛，拜仁在两球领先的情况下，被尤文图斯连进两球，2-2逼平。尽管如此，拜仁还是握有两个客场进球的优势。此役双方都有重要球员缺席，尤文方面缺席马尔基西奥、迪巴拉和基耶利尼等大将，而拜仁方面则缺席了罗本，博阿滕，巴德施图贝尔、马丁内斯等大将。 随着裁判的一声哨响，比赛开始了，第5分钟，阿拉巴没有防守住杀入禁区的利希施泰纳，后者抓住诺伊尔出击的空当传球中路，博格巴跟进推射空门得分，0-1，尤文取得梦幻开局！第28分钟，阿拉巴被莫拉塔断球连续突破三人，长驱直入在禁区前沿被包夹随即推传，大禁区前沿右侧夸德拉多拿球扣过拉姆抽射近角破门，0-2！半场战罢，拜仁0-2落后尤文图斯。易边再战，第73分钟，贝尔纳特长传，科曼底线救球回敲，科斯塔挑传球门左侧，莱万高高跃起小角度头球破门，1-2，拜仁扳回一分！第90分钟，比达尔反抢成功直塞，科芒下底传中，穆勒后点轻松破门，2-2，拜仁扳平！比赛来到加时赛，第108分钟，科斯塔传中被挡出，蒂亚戈再传，禁区内穆勒分到身边，蒂亚戈跟进抽射破门，3-2！拜仁反超！第110分钟，拜仁后场断球反击，科曼右路大步流星向前带球，原地摆脱防守往中路横切兜一脚远射破门，4-2，拜仁主场上演大逆转！最终，拜仁慕尼黑4-2尤文图斯，总比分6-4，拜仁晋级8强。 老妇人尤文图斯和班霸拜仁慕尼黑，毫无疑问这是两支伟大的球队，各自过去都获得了许多荣誉。因为拜仁手握两个客场进球的优势，同时在球队整体实力上相对比老妇人也略胜一筹，所以赛前绝大多数人都不看好斑马军团，最终结果也像大家想的那样尤文输了。 虽说成败论英雄，但是败得并不是毫无意义。如果你完整的看了整场比赛，你会发现其实斑马军团通过自己不懈的努力，为自己创造了晋级的机会，成功离其当时只有一步之遥。贵为上赛季的欧冠亚军，在八分之一淘汰赛就被淘汰了，难免令人可惜。尤其是当你看到了布冯一次次的努力精彩扑救。老妇人是成功的，他们的 努力拼搏态度，永不放弃的战斗精神 ，深深的刻入了球迷的心中。 在14-15赛季四分之一淘汰赛，尤文对阵皇马，赛前大家都认为尤文（整体年龄偏大，像布冯，皮尔洛，埃弗拉等）是送给皇马的一个大礼包，尤文一声不吭的以两回合总比分3-2击败皇马，从而走上了决赛之路。 尤文图斯给人总是非常低调，成熟稳重的感觉，很少大起大落，大赛中波澜不惊，就像它老妇人的外号一样。总是在不被别人看好的情况下给予最强力的回击，总是默默的前行。 本赛季的英超的莱斯特城，赛季初目标只是想保级，没想到却一步一步走上了英超榜首的位置了。在媒体采访莱斯特城主帅拉涅利时，他在专访中表示，在足球金元时代，莱斯特城这个小俱乐部取得的成就是难以置信的。拉涅利表示球队已经确保最重要的保级目标完成了，下一目标就是欧冠资格，最后再考虑英超冠军，球队需要一步步来。莱斯特城之所以能取得这样的成绩，除了外界的原因，更多的是来源自己努力拼搏，顽强的战斗精神。首先他们 知道自己的能力，给自己一个定位，通过自己的努力不断拼搏巩固，从而不断的攀高 。这样的逆袭故事总是可歌可泣的。 有着雄心壮志，却又肯脚踏实地干活。只有下层建筑基础做好了，你才能去完成大的成就。","tags":"生活杂集","title":"老妇人的触动"},{"url":"http://yeching.info/pelican.html","text":"欢迎来到Pelican! Pelican 是由 python 写的一个静态网站生成器，不能使用数据库。 Pelican的一些特征： 可以按多种标记语言的格式写你的内容 可以通过 JinJa 模板定制属于你的主题 可以以多种语言发布你的内容 Atom/RSS订阅 可以支持插件 建造你的Blog 如果你喜欢 python 这门编程语言，那么你可以参考 Pelican文档 ，通过使用相应的 Pelican－Themes 或者通过定制来实现你喜爱的主题，从而建造属于你的Blog,接着就是写一些你想写的或想与他人分享的一些东西。","tags":"计算机技术与应用","title":"Pelican"},{"url":"http://yeching.info/qing-liang-ji-biao-ji-yu-yan.html","text":"1.为什么会有轻量级标记语言？ 一般我们所知道的标记语言: HTML 。因为它的功能非常强大，支持非常多的功能，所以它的规范标准就比较多了，相应的想要快速学会使用它就更难了。而对于有些人来说，他并不需要有那么多的功能语言，他仅仅需要常用的几个功能，同时花更多的时间在文字内容上而不是在标记语言本身上，在这个背景下孕育了一些轻量级的标记语言，个人比较常用的有 Markdown 和 reStructuredText 两种。 2.那些人群需要？ 对于那些爱写博客，撰稿写作者或需要快速成文的人，他们比较注重内容本身，同时又不想像纯文本那样单调，那么这种标记语言就适合他们了。他们可以在很短的时间就学会标记语言的规范，然后投入使用，并且文章的标题、段落、强调加粗等都可以表现出来。 3.支持那些常用功能？ 标题 段落 列表 引用 图片与链接 粗体与斜体 表格 代码框 分割线 4.如何使用(Markdown)？ 区块元素 段落 前后要有一个以上的空行 标题: 文字前加 # 号即可 # 这是标题一 ## 这是标题二 区块引用 在整个段落的第一行最前面加上 > 列表 有序列表和无序列表 无序列表使用星号、加号或是减号作为列表标记 * 有序列表则使用数字接着一个英文句点 分隔线 你可以在一单独行中用三个以上的星号、减号来建立一个分隔线 区段元素 链接 文本链接：[链接名称](链接地址) 图片链接：![链接名称](链接地址) 强调 **加粗** *倾斜* 代码 要标记一小段行内代码，你可以用反引号（`）把它包起来 5.更多文档 Markdown: 1.官方文档: 英文版 中文版 2.其他： 认识与入门 Markdown 作业部落 reStructuredText: reStructuredText 入门","tags":"计算机技术与应用","title":"轻量级标记语言"},{"url":"http://yeching.info/ru-he-kuai-su-zhang-wo-yi-men-xin-ji-zhu-yu-yan-kuang-jia.html","text":"IT行业中的企业特点是都属于知识密集型企业。这种企业的核心竞争力与员工的知识和技能密切相关。而如果你在企业中扮演的是工程师的角色的话，那么你的核心竞争力就是IT相关的知识与技能的储备情况。而众所周知，IT行业是一个大量产生新知识的地方，就拿Web前端举例，短短的5，6年时间，Web前端已经经历了数次变革，就目前来看变革还将继续下去。从以前的div+css网格化布局到JavaScript的方兴未艾，然后是各种JavaScript框架的百家争鸣，HTML5和CSS3的落地，移动web冲击下带来的响应式设计，jQuery,AngularJs,ReactJs等操作DOM元素截然不同的理念和方式，web component的标准化进程……为什么现在企业到处都在招前端工程师？好像突然之间，前端工程师成了稀缺资源。这里的原因之一就是很多前端工程师跟不上行业变化，无法达到目前市场上对前端工程师的能力和要求。在这种大环境下，工程师能够掌握快速学习的能力就变的至关重要。 笔者根据自身的亲身体会，以及结合对周围同事的观察，对如何快速掌握一门新技术（这里的技术包括一门新的IT技术，包括一门新的编程语言，抑或一种新的程序框架等）有着以下几点指导。 要想快速掌握一门新技术，首先有两个先决条件。 1. 首先思想要主动求变，敢于跳出的自己的舒适区，对任何技术都抱有开放的心态。贪图安稳是人的本性。而这种本性往往会阻碍你的发展。人所能了解的知识的多少，取决于自己的舒适区有多大，舒适区越大，与外界接壤的范围越大，就越感觉自己的无知。程序员至少要做到两点，不要对自己不了解的技术心存偏见，不要对自己不熟悉的技术心存恐惧。 2. 要化被动式学习为主动式学习。在中国很大一批程序员每天都是在被动式学习。什么是被动式学习？就是被人、事逼着去学习。今天新启动一个项目，技术调研不想采用新的技术，开发过程中碰到难题才会去查资料，整天就是把别人的、自已以前写的代码复制重用，复制以后出问题了也要花好长时间解决。举个例子，一个程序员使用了Spring好几年，都不知道Spring的核心理念，不知道Spring框架结构，不知道Spring各个组件功能，不知道Spring新版本的新特性。这是非常可怕的，因为你不知道这些东西，就无法采纳Spring的最佳实践，出现问题不知道如何快速定位，项目中的某些需求就无法使用Spring早已封装好的功能（因为你不知道Spring还能干这个）。主动式学习需要你未雨绸缪，不能临时抱佛脚。而且要把学习看做是对自己的积累和提高，看成是对自己的长期投资，不能抱有太强的功利性。 有人说，我就是喜欢舒适区，我就是不喜欢主动学习，有什么好的方式和方法改变这两点？说实话，我所能提供给你的帮助很有限。正如《后会无期》里的一句台词，\"我听过很多大道理，可依然过不好这一生\"。这两点还是更要靠你个人来实现。而接下来的一些点，我相信可以帮助到你。 1.学习一门新技术前，先要搞清楚为什么要学习它？没这个技术前我们是怎么干活的？有了它以后我们又是怎么干活的？它带来了哪些改变？其实问这些问题，就是为了了解该技术解决或者简化了那个问题域的问题，又是采用了什么方式达到了这样的效果。就拿AngularJS为例，AngularJS最初是为了弥补HTML构建应用的不足。以前的HTML在设计时是为了展示多媒体信息，后来虽然拓展了一些动态功能，但是在应用web化的潮流下，HTML设计上的不足就越来越突出。比如DOM元素操控太繁琐、业务逻辑很难模块化、可测性低、开发效率底下等。而AngularJS采用了一种全新的设计来解决该问题，它提出了一系列概念，引入了数据绑定、标识符、路由、依赖注入等特性，大大简化了我们开发WEB开发的工作量。通过这样的方式能迅速建立起了对该技术的宏观认识，了解了其潜在的应用场景、应用方式以及一些局限性等。 2.接下来就要实际使用一下该技术的核心的功能，强化对它的认识。方式就是参考该技术官网的Quick Start（快速开始）章节，一步一步来。 现在的程序员越来越珍惜时间，文档的简洁性、完备性、易上手都成了是否采纳某项技术的指标之一。尤其是现在的各种开源组件，连文档都是开源的。 所以很多文档都是完全按照程序员的思维写的，读起来很清爽。再拿Spring来说，想学习Spring4.0推出的Spring boot组件，那么可以访问其官网，页面上最大的按钮就是Quick Start。点击学习吧。页面是一个简单的例子，可能花不了你五分钟。如果还没过瘾，右边又列出了更多的 Getting Started Guides ，也是一步一步的教你进阶功能。有些人可能要问了，英语不好怎么办？请学英文。 英文是一个优秀程序员的必备技能。 可能也有人说，看文档时有各种杂音咋办。比如看Spring boot的start guide，需要之前对Spring有一定了解，需要知道tomcat、jetty是干啥的，需要有一定gradle或者maven使用经验…这些知识在演练Spring boot的那个小程序时都需要，但由于这些杂音的干扰，会拖慢学习的过程。摆脱这些杂音的唯一方式就是，对于那些不了解的知识点，也花时间去学习吧。 所以学习是一个良性循环的过程，学的越多，就学的越快。 3.前面两步能够保证你对一门技术入门，那么如何进阶那？这个阶段就是读了。从官网上把该技术的详细文档扒拉下来，使劲读吧。通读这些文档能让你进入它的实现细节，以及各种使用方式与场景，甚至一些最佳实践。比如Spring boot官方文档，详细到了牙齿。凡是你想到的、没想到的，文档都贴心的列了出来。如果你想学习Scala，那么请访问http://www.scala-lang.org/documentation/，各种文档应有尽有，读完就是大半个Scala专家。 一门技术最好的文档必须是它的官方文档， 如果不是，那么这门技术火不了。注意通读文档的过程中一定要在项目加以运用。如果在项目中没实践机会，自己可以写一些小的demo来实践。 学习知识时实践与理论相结合的道理恒古不变。 4.走完前三步，你对这门技术的理解已经比大多数人强了。你可以算掌握这门技术了。那么还有进阶方式没？当然有，那就是把你所学、所想讲出来，写出来，暴露在公众之下，接受批判，从而发现自己的不足，促使你进步。有空给大家做几个讲座，写几个系列文章，那么你在大家眼中就成了这门技术的牛人。你就有了各种机会来解决使用该技术遇到的各种疑难杂症，反过来加深和修正你的理解。没事上上StackOverFlow，回答别人几个问题，或者订阅该技术的问题列表，经常看一看。 5.还可以再继续深入。加入国内/国际技术社区（国内没这样的社区咋办，机会来了，赶紧自己建一个），进一步发挥自己影响力。翻译、编写与该技术相关的书籍；如果该技术是开源的，那么有时间就提交修改把，自己就成了开发者一员了。这就是质的飞跃，从使用工具进阶到创造工具。 走完5步，你已经不是仅仅掌握这门技术了，你已经超神了好吧！有人可能又会问，能达到这五步的肯定要花很长时间，不是一般人能够到的高度。那当然了，这个过程肯定很难，但并非难到登天。至少我身边有很多这样的例子。其实你只要完成前三步，你就比50%的程序员牛了，完成第四步，你已经站在90%程序员的前面。 最后快速总结。重要的事情说三遍。 1.主动学习很重要，主动学习很重要，主动学习很重要。 2.官方文档很重要，官方文档很重要，官方文档很重要。 3.实践很重要，实践很重要，实践很重要。 作者 ： 黄博文@无敌北瓜 出处 ： http://www.cnblogs.com/huang0925","tags":"计算机技术与应用","title":"如何快速掌握一门新技术/语言/框架"},{"url":"http://yeching.info/da-ji-he.html","text":"记录一些有用的关于学习生活的各种网站，软件工具等等 各种网盘工具： 1. 微盘 :一个提供各种格式电子书籍资源下载的地方,配合各种阅读器。 2. 百度云盘 和 360云盘 ：属于大容量云盘，可以用来存储各种电影，纪录片，等大型文件。 3. 印象笔记 和 麦库笔记 ：可以用来记笔记和写点自己的东西。 常用的两种轻量级标记 1. Markdown 2. reStructuredText 具体请看 轻量级标记语言 。。。不断更新","tags":"学习方法与思考","title":"工具大集合"},{"url":"http://yeching.info/xue-xi-ying-yu.html","text":"目标与兴趣 从初中到现在，我也学了将近10年的英语。一直以来，学习英语好像一直是为了考试才学的，纵使有时候考了不错的分数，但是要是别人一问英语实际正常使用怎么样啊，那个心里真是没底气。 其实说实话，我对英语挺感兴趣的。为什么感兴趣还学的不咋样呢？因为除了考试，我未曾感觉到英语对我的重要性，让我有一个非要学习它的理由，所以即使有兴趣也不足以推动你去自我学习，发自内心的想要去学习它,。 真正让我想要好好学习英语的时候，是在大二下学期，这个时期自己对计算机技术挺感兴趣了，但是好多的文档手册都是英文的，外国的最新技术博客等都是英文的，自己不得不去看。密密麻麻的全是英文字母，第一眼看上去，就让人有想要放弃的感觉。这个时候如果仅有兴趣的话，恐怕你早以放弃。 兴趣它是让你做一件事情很容易感到开心，容易知足且有成就感。当一件事情一上来就让你感受到恐惧和困难的话，兴趣它的力量就有点小了。个人一直认为兴趣它在顺境的情况下，的确有着大的驱动力，当在逆境的时候就显得有点微不足道了。 举个例子： 有两个小孩，都特别喜欢学习武术，Ａ学习武术的想法是：他感觉学习武术非常酷，尤其是当他看见其他人使出一招招高难度动作后，获得周围观众掌声时，他更按耐不住想要学习武术了。而Ｂ的想法是：在学校，别人总是欺负他，让他干他不愿意干的事，他想要通过学习武术，摆脱这样的窘境。一天，Ａ和Ｂ同时来到一家武馆拜师学艺，第二天，他们开始学习武术了，师傅教他们扎马步，第三天还是扎马步，往后还是不断的扎马步走树桩，同时逐渐加长时间和加大负重，偶尔也学学简单的招式。这样的情况持续到十五天的时候，Ａ放弃了，他受不了这样的学习武术，他觉得这和他想要的武术不一样，而Ｂ坚持住了，难道Ｂ知道这是学习武术的基础，需要扎实的基本功？最重要的是Ｂ他不想被别人欺负，他想要通过学习武术让自己变得强大，能够保护自己。在这15天学习的过程中，他也感觉到自己好像更有自信了，往后的剧情自己想象...... 刚开始，让我能够硬着头皮继续往下看的原因是，它对我重要。仔细一看内容，好多都是能够看明白的，只有少数的陌生词汇不认识，我知道开始是内心的恐惧让我放弃了，连尝试都没有尝试( 对于渴望而有未知的东西，你要敢于迈出第一步 )，当内心的恐惧消除以后，此时兴趣就开始发挥作用了，坚持，专注什么的就相当容易了.虽然现在还没达到非常优秀的地步，但可以预见会变得越来越好。 时间关系 有时候感觉学了好几年的英语还不如别人强化训练几个月的，刨去方法，天赋等因素，另一个要谈到的那就是有效学习时间的问题了。我们一直以来用于学习英语的时间到底有多少呢？就是每周英语课的时间，而每周的加起来的总时间最多不过10个小时（一天两小时），并且这10个小时还是分割开来的。那么就会存在这样的情况，昨天的学的东西到今天忘了好多了，今天学的可能又是建立在昨天的基础上的，导致今天的没有跟上或听明白；同时每次开始上英语课的时候，你从汉语思维转到英语思维中来还需要一定时间的，也就是说你还需要一定时间来进入学习英语的状态，或者你上课困了，睡了一觉没有学习等等一系列问题。导致你的一周实际有效学习时间也就几个小时了（算４小时），一年下来也就4乘以40周等于160小时。根据人的记忆特性，你可能经过一个暑假或寒假没有复习，基本上又一假回到解放前了，学了几年你一直没有什么进步，学来学去还是只会刚开始学英语的几句话，什么how are you 或者nice to meet you.从始至终我们就一直没有进入到学习英语的状态。 接下来再来看强化训练几个月的方式，这种方法可取的之处就是它解决了我们之前的遇到的问题。首先它是连续性的学习(一天学习八个小时，且比较有针对性)，根据人的学习记忆特性，有助于思维的养成；同时在这连续的时间段内，你可以不断重复得到训练，可以发现错误，纠正从而产生正累积效应（可以更加有针对性）。 我的一些方法（用中学）： 看技术文档，查看wiki，阅读书籍，文章，翻译一些喜欢的东西 音乐，对话，电影，纪录片， Note: 英文环境，目标明确有针对，重复训练有提高，时间长短看自己，进步与否看行动 总结： 首先 明确你的目标 ，这样你就会非常重视他，时刻将它放在心上。之后就是不断使用学习，不断犯错，不断纠正，体会学习给你带来的收获，从而更加坚定你的信心，让兴趣引导你前进。语言类的就是在不断使用，不断重复从而达到一种让你有种脱口而出的感觉，你并不需要非常刻意经过思考从中文的翻译为英语。我们可以想想婴儿学东西的方式，我们刚出生下来，到慢慢的自己会说话的过程中，我们并不是准备充分了才开始说话的，而是不断使用中学习的（模仿，犯错，学习），最后形成自己的思维。 还有就是 有效学习 时间要足够长，总是三天打鱼，两天晒网，时不时学一下，基本上是没有效果的。必须自己主动的学习，而不是好像被迫的推着前行。 All along, the action is the best way Go-Go-Go Action-Action-Action 最后来碗热腾腾的鸡汤： 你是否有这样干过一件事情，每天你起早贪黑，每天你废寝忘食，每天你满腔热血的拼搏，每天你不顾一切的拼搏，坚定不移而有满怀斗志的朝着你的目标前进，只为那一刻，而那一刻的过程总是孤独而又困难重重的。如果你不曾这样，就请你闭嘴前行亦或是呆在生硬的现实之中。","tags":"English-Learning","title":"Learning English"},{"url":"http://yeching.info/liang-bian-yu-zhi-bian-de-guan-xi.html","text":"生活小故事一： 做菜的时候，可能是量太大了或者今天味觉不太灵敏，当你第一次放了盐的时候，你品尝发现太淡了，于是乎你有加了一点点盐，品尝发现还是太淡了，你又一次重复操作，发现还是太淡了，你有点不耐烦了，一下加了上一次的好几倍量。这一次你品尝，你发现，完了完了，好像有点太咸了。（该咋办啊？还能咋办啊，就是吃呗） 生活小故事二： 有一天，因为有急事，中午没能吃上午，忙完了已见天上的星星月亮了，那把我一个饿的，根本看不见路在何方。终于可以吃饭了，我拿起碗框框的就干了两碗，咋回事，肚子感觉还是有点不够，接着继续吃，吃到第四碗的时候，完了，好像吃不下去了。 道理非常简单，就是量的变化达到质变的条件了，从而产生了质变。它的过程是循序渐进的。从准备过程，慢慢到条件满足，从而产生质的变化。 质的变化是量变的必然结果 。 万事万物都是由一个量变到一个质变的过程，许多事情（包括思想，学识）的发生和改变都有一定先后顺序，你只有建立在前面的一定基础上（达到一定尺度，突破一定限度和范围），才能呈现目前的结果。同时又要注意 时效性，空间性 。 当你回头看自己曾经学习的知识或者写的东西时，你有时会感觉到幼稚，好笑。其实非常正常，事物发展的规律就是这样的。就像婴儿刚生下来，从什么都不知道（也许他也知道一些），到慢慢变成成人的过程，是慢慢变化的， 连续性的而不是跳跃的 。可能你会说某某人，什么时候突然开窍，顿悟。其实这没有跳跃，只是相对之前的慢速度，突然一个提速（例如汽车启动），让你感觉到飞飞跃的过程。事实是先有了前面的慢速，才会有后面的似飞跃的过程。 开窍顿悟其实是知识积淀的必然结果 。有的人终身迷惑，其实离顿悟只有一步之遥，然而这一步却是必不可少的，因为只有加上这一步（可能是某件事的刺激或者某人的点醒）才达到触发的条件，现实是有的人他们直到离开这个世界，还是没有满足这个条件，从而抱憾终身。 有些人学习新的知识时，总是给自己设限制，自己只会什么，而这个什么不会的。这些人是凭什么得出这样的结论？他们为什么会得出这样的结论？答案是他们一眼就看到山顶上去了，而这座山又非常高，他们直接就感觉自己不可能爬上去，他们心里产生了恐惧（心里作用）。当一个人内心产生了恐惧，那么他干一件事成功的概率就非常小了。为什么有的人就能够成功？ 首先他的 思想与视野 已经到达了一个高度。他认识到事物的本质，事物的发展规律。知道万丈高楼平地起，一步一步的往上爬，最终就能够爬到终点。把心理上的恐惧克服了（打败你自己） 其次 行动的力量 （鼓起勇气，走出你的第一步），敢于走出第一步，再辅以 专注与坚持 ，登顶不是问题。 一个人的思想与视野，也就是思维观念，对一个人的影响是巨大的，有的人年龄到了一百岁，而他的思想与视野只有50岁；有的人年龄只有50岁，思想层面已相当于100岁。当你的思想与视野没有到达一个层次高度，你就会认识不足，从而导致各种心理问题，阻碍你前进。 为什么有些非常有影响的思想观念，在有些人看来觉得根本没有价值可言。因为他们还没达到那个层次，所以有可能感觉不到或者体会不到（不知道自己的无知），要理解它你得先有一定的高度。 事物的发展最终离不开质变，没有质变就没有发展。只有形成质变，才能突破原有物质的固有属性，从而实现事物的发展进步。质变是量变的必然结果，这一事物规律，我们要坚信它。在我们学习生活中，社会发展进程中合理利用好这一点，对我们的意义是非常重大的。","tags":"学习方法与思考","title":"量变与质变的关系"},{"url":"http://yeching.info/how-to-read-a-book.html","text":"前言： 《如何阅读一本书》英文原名叫做《How To Read A Book》，是由美国的莫提默·J. 艾德勒和查尔斯·范多伦共同完成的（1970年新版）。阅读完这本书的时候，第一感觉就是太了不起了，把阅读讲解的这么全面而又细致，里面的说的很多理念和方法值得学习；接着就是遗憾了，因为自己曾经与它有过一面之缘，但是因为自己的无知与他错过了（当时自己看了一眼封面，一个人拿着一本书，立马就做出判段，读书这样简单的东西还用学吗？教教小学生还行，自己当时读大一）。第二次的相遇已发生与两年后，源于自己在网上看到一篇博客谈论到这本书，说的一些方法和理念感觉都挺好的，从而让我再一次与其相遇。 开篇 书的开篇就谈到本书的目标人群，这本书是 为那些想把读书的主要目的当作是增进理解能力的人写的 。 阅读它 本质上是一种主动的活动 ，阅读常见的三种目的： 娱乐消遣、获取资讯、增进理解力 。只有最后一种目的的阅读对帮助阅读者增长心智，不断成长比较有用。 作者将阅读分为四个层次，分别是 基础阅读(elementary reading)、检视阅读(inspectional reading)、分析阅读(analytical reading)、主题阅读(syntopical reading) 。他们是循序渐进的，每一层都建立在前面的基础之上的。然后详细讲了每一层次的阅读方法和一些技巧，同时文中还穿插着列出了许多 名著书籍。 1.阅读的第一个层次：基础阅读 一个人只要熟练这个层次的阅读，就摆脱了文盲的状态，至少已经开始认字了。在熟练这个层次的过程中，一个人可以学习到阅读的基本艺术，接受基础的阅读训练，获得初步的阅读技巧。例如当我们想要读一本英文写的书时，摆在我们面前的第一个问题就是，认识每一个单词，从而才能理解其说的意思。在这个层次的阅读中，要问读者的问题是： \"这个句子在说什么？\" 2.阅读的第二个层次：检视阅读 也叫略读或预读，当然略读不是随便或随意浏览一下，而是在一定的时间之内，抓出一本书的重点—通常是很短，而且总是（就定义上说）过短，很难掌握一本书所有重点。 这个层次要问的典型问题就是：\"这本书在谈什么？\"或者类似的\"这本书的架构如何，包含那些部分，属于哪一类的书？\" 3.阅读的第三个层次：分析阅读 在这个层次中，读者要让这本书成为他自己。分析阅读就是全盘的阅读、完整的阅读，或是说优质的阅读—读者能做到的最好的阅读方式。如果说检视阅读是在有限的时间内，最好也最完整的阅读，那么分析阅读就是在无限的时间里，最好也最完整的阅读。分析阅读就是要咀嚼与消化一本书。如果读者的目标只是获得资讯或消遣，就完全没有必要用到分析阅读。 分析阅读就是特别在追寻理解的，这个过程中你就好像交流一样，需要不断的提出问题，解答问题。 4.阅读的第四个层次：主题阅读 第四种，也是最高层次的阅读，在做主题阅读时，阅读者会读很多书，而不是一本书，并列举出这些书之间相关之处，提出一个所有的书都谈到的主题。但只是书本字里行间的比较还不够。主题阅读涉及的远不止此。 借助所阅读的书籍，主题阅读者要能够架构出一个可能在哪一本书里都没提过的主题分析。因此，很显然的，主题阅读是最主动、也最花力气的一种阅读。 想要了解更加详细内容，可以阅读原书， 记住书名：《How to read a book》 总结： 一样东西纵使有千般好，它也有不足，那就是太好了。一千个人眼里有一千个哈姆雷特，我们需要有自己的判断，从中获得属于自己的一部分，而不是全盘接收。自己看完的收获： 知道自己的需求，明确自己的目标：\"我为什么需要阅读\"？以及\"我为什么需要读这本书\"？ 本书给我的实际知识收获： 阅读是一种主动的活动 阅读是有层次之分的 阅读书籍需要阅读不同种类的书，知道自己读的是哪一类书，读不同书需要不同的方法 阅读时需要思考，提出问题，解决问题，有自己的主观判断 最重要的一点 ：你得看书，在实际阅读中运用，实践是检验理论的标准，同时让你领悟的更深刻，从而得出自己的心得。别到时说一点用也没有，存在即合理，事物的价值不仅仅体现在事物本身(最低价值)，还得有人发挥出它的价值（up）。","tags":"水之源","title":"如何阅读一本书"},{"url":"http://yeching.info/welcome_to_here.html","text":"你好，欢迎来到yeching的个人博客网站。 本博客主要写一些个人经历，好的学习方法和思想，书籍推荐，以及一些计算机方面的基础知识。本博客网站采用的是 Python 编写的 pelican 的静态博客生成系统建立的，网站空间用的是 GitHub 提供的，通过 Git 分布式版本控制系统管理，域名是在 Godaddy 注册的，主题用的是 Elegant ，标记语言采用的是 Markdown 。 欢迎关注和交流。","tags":"本网站相关内容","title":"Welcome to here！"},{"url":"http://yeching.info/site_declarations.html","text":"内容说明 博文内容主要以个人的经历和感受理解为主写的，由于自己的无知，可能会出现各种的不足，欢迎指出。 博文内容有参考时，会尽量列出参考来源。如果有侵权，请告知本人删除。 网站说明 网站域名：域名是在 Godaddy 申请的。 网站主机：网站主机目前用的是 Github 提供的免费空间。 网站框架：网站是使用 pelican 采用 pelican-elegant 主题建的。","tags":"本网站相关内容","title":"网站说明"},{"url":"http://yeching.info/sitelog.html","text":"2015-11-27：网站初始框架完成","tags":"本网站相关内容","title":"网站日志"}]}